zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cm_jh/pic32cm_jh01/pic32cm2532jh01048-pinctrl.h
/* pa16c_sercom1_pad0 */
#define PA16C_SERCOM1_PAD0 MCHP_PINMUX(a, 16, c, periph)

/* pa16d_sercom3_pad0 */
#define PA16D_SERCOM3_PAD0 MCHP_PINMUX(a, 16, d, periph)

/* pa16e_tcc2_wo0 */
#define PA16E_TCC2_WO0 MCHP_PINMUX(a, 16, e, periph)

/* pa16f_tcc0_wo6 */
#define PA16F_TCC0_WO6 MCHP_PINMUX(a, 16, f, periph)

/* pa16g_pdec_qdi0 */
#define PA16G_PDEC_QDI0 MCHP_PINMUX(a, 16, g, periph)

/* pa16h_gclk_io2 */
#define PA16H_GCLK_IO2 MCHP_PINMUX(a, 16, h, periph)

/* pa16i_ccl_in0 */
#define PA16I_CCL_IN0 MCHP_PINMUX(a, 16, i, periph)

/* pa16k_ptc_ds20 */
#define PA16K_PTC_DS20 MCHP_PINMUX(a, 16, k, periph)

/* pa17_gpio */
#define PA17_GPIO MCHP_PINMUX(a, 17, gpio, gpio)

/* pa17a_eic_extint1 */
#define PA17A_EIC_EXTINT1 MCHP_PINMUX(a, 17, a, periph)

/* pa17b_ptc_x5 */
#define PA17B_PTC_X5 MCHP_PINMUX(a, 17, b, periph)

/* pa17b_ptc_y21 */
#define PA17B_PTC_Y21 MCHP_PINMUX(a, 17, b, periph)

/* pa17c_sercom1_pad1 */
#define PA17C_SERCOM1_PAD1 MCHP_PINMUX(a, 17, c, periph)

/* pa17d_sercom3_pad1 */
#define PA17D_SERCOM3_PAD1 MCHP_PINMUX(a, 17, d, periph)

/* pa17e_tcc2_wo1 */
#define PA17E_TCC2_WO1 MCHP_PINMUX(a, 17, e, periph)

/* pa17f_tcc0_wo7 */
#define PA17F_TCC0_WO7 MCHP_PINMUX(a, 17, f, periph)

/* pa17g_pdec_qdi1 */
#define PA17G_PDEC_QDI1 MCHP_PINMUX(a, 17, g, periph)

/* pa17h_gclk_io3 */
#define PA17H_GCLK_IO3 MCHP_PINMUX(a, 17, h, periph)

/* pa17i_ccl_in1 */
#define PA17I_CCL_IN1 MCHP_PINMUX(a, 17, i, periph)

/* pa17k_ptc_ds21 */
#define PA17K_PTC_DS21 MCHP_PINMUX(a, 17, k, periph)

/* pa18_gpio */
#define PA18_GPIO MCHP_PINMUX(a, 18, gpio, gpio)

/* pa18a_eic_extint2 */
#define PA18A_EIC_EXTINT2 MCHP_PINMUX(a, 18, a, periph)

/* pa18b_ptc_x6 */
#define PA18B_PTC_X6 MCHP_PINMUX(a, 18, b, periph)

/* pa18b_ptc_y22 */
#define PA18B_PTC_Y22 MCHP_PINMUX(a, 18, b, periph)

/* pa18c_sercom1_pad2 */
#define PA18C_SERCOM1_PAD2 MCHP_PINMUX(a, 18, c, periph)

/* pa18d_sercom3_pad2 */
#define PA18D_SERCOM3_PAD2 MCHP_PINMUX(a, 18, d, periph)

/* pa18e_tc4_wo0 */
#define PA18E_TC4_WO0 MCHP_PINMUX(a, 18, e, periph)

/* pa18f_tcc0_wo2 */
#define PA18F_TCC0_WO2 MCHP_PINMUX(a, 18, f, periph)

/* pa18g_pdec_qdi2 */
#define PA18G_PDEC_QDI2 MCHP_PINMUX(a, 18, g, periph)

/* pa18h_ac_cmp0 */
#define PA18H_AC_CMP0 MCHP_PINMUX(a, 18, h, periph)

/* pa18i_ccl_in2 */
#define PA18I_CCL_IN2 MCHP_PINMUX(a, 18, i, periph)

/* pa18k_ptc_ds22 */
#define PA18K_PTC_DS22 MCHP_PINMUX(a, 18, k, periph)

/* pa19_gpio */
#define PA19_GPIO MCHP_PINMUX(a, 19, gpio, gpio)

/* pa19a_eic_extint3 */
#define PA19A_EIC_EXTINT3 MCHP_PINMUX(a, 19, a, periph)

/* pa19b_ptc_x7 */
#define PA19B_PTC_X7 MCHP_PINMUX(a, 19, b, periph)

/* pa19b_ptc_y23 */
#define PA19B_PTC_Y23 MCHP_PINMUX(a, 19, b, periph)

/* pa19c_sercom1_pad3 */
#define PA19C_SERCOM1_PAD3 MCHP_PINMUX(a, 19, c, periph)

/* pa19d_sercom3_pad3 */
#define PA19D_SERCOM3_PAD3 MCHP_PINMUX(a, 19, d, periph)

/* pa19e_tc4_wo1 */
#define PA19E_TC4_WO1 MCHP_PINMUX(a, 19, e, periph)

/* pa19f_tcc0_wo3 */
#define PA19F_TCC0_WO3 MCHP_PINMUX(a, 19, f, periph)

/* pa19h_ac_cmp1 */
#define PA19H_AC_CMP1 MCHP_PINMUX(a, 19, h, periph)

/* pa19i_ccl_out0 */
#define PA19I_CCL_OUT0 MCHP_PINMUX(a, 19, i, periph)

/* pa19k_ptc_ds23 */
#define PA19K_PTC_DS23 MCHP_PINMUX(a, 19, k, periph)

/* pa20_gpio */
#define PA20_GPIO MCHP_PINMUX(a, 20, gpio, gpio)

/* pa20a_eic_extint4 */
#define PA20A_EIC_EXTINT4 MCHP_PINMUX(a, 20, a, periph)

/* pa20b_ptc_x8 */
#define PA20B_PTC_X8 MCHP_PINMUX(a, 20, b, periph)

/* pa20b_ptc_y24 */
#define PA20B_PTC_Y24 MCHP_PINMUX(a, 20, b, periph)

/* pa20c_sercom5_pad2 */
#define PA20C_SERCOM5_PAD2 MCHP_PINMUX(a, 20, c, periph)

/* pa20d_sercom3_pad2 */
#define PA20D_SERCOM3_PAD2 MCHP_PINMUX(a, 20, d, periph)

/* pa20e_tc3_wo0 */
#define PA20E_TC3_WO0 MCHP_PINMUX(a, 20, e, periph)

/* pa20f_tcc0_wo6 */
#define PA20F_TCC0_WO6 MCHP_PINMUX(a, 20, f, periph)

/* pa20h_gclk_io4 */
#define PA20H_GCLK_IO4 MCHP_PINMUX(a, 20, h, periph)

/* pa20k_ptc_ds24 */
#define PA20K_PTC_DS24 MCHP_PINMUX(a, 20, k, periph)

/* pa21_gpio */
#define PA21_GPIO MCHP_PINMUX(a, 21, gpio, gpio)

/* pa21a_eic_extint5 */
#define PA21A_EIC_EXTINT5 MCHP_PINMUX(a, 21, a, periph)

/* pa21b_ptc_x9 */
#define PA21B_PTC_X9 MCHP_PINMUX(a, 21, b, periph)

/* pa21b_ptc_y25 */
#define PA21B_PTC_Y25 MCHP_PINMUX(a, 21, b, periph)

/* pa21c_sercom5_pad3 */
#define PA21C_SERCOM5_PAD3 MCHP_PINMUX(a, 21, c, periph)

/* pa21d_sercom3_pad3 */
#define PA21D_SERCOM3_PAD3 MCHP_PINMUX(a, 21, d, periph)

/* pa21e_tc3_wo1 */
#define PA21E_TC3_WO1 MCHP_PINMUX(a, 21, e, periph)

/* pa21f_tcc0_wo7 */
#define PA21F_TCC0_WO7 MCHP_PINMUX(a, 21, f, periph)

/* pa21h_gclk_io5 */
#define PA21H_GCLK_IO5 MCHP_PINMUX(a, 21, h, periph)

/* pa21k_ptc_ds25 */
#define PA21K_PTC_DS25 MCHP_PINMUX(a, 21, k, periph)

/* pa22_gpio */
#define PA22_GPIO MCHP_PINMUX(a, 22, gpio, gpio)

/* pa22a_eic_extint6 */
#define PA22A_EIC_EXTINT6 MCHP_PINMUX(a, 22, a, periph)

/* pa22b_ptc_x10 */
#define PA22B_PTC_X10 MCHP_PINMUX(a, 22, b, periph)

/* pa22b_ptc_y26 */
#define PA22B_PTC_Y26 MCHP_PINMUX(a, 22, b, periph)

/* pa22c_sercom3_pad0 */
#define PA22C_SERCOM3_PAD0 MCHP_PINMUX(a, 22, c, periph)

/* pa22d_sercom5_pad0 */
#define PA22D_SERCOM5_PAD0 MCHP_PINMUX(a, 22, d, periph)

/* pa22e_tc0_wo0 */
#define PA22E_TC0_WO0 MCHP_PINMUX(a, 22, e, periph)

/* pa22f_tcc0_wo4 */
#define PA22F_TCC0_WO4 MCHP_PINMUX(a, 22, f, periph)

/* pa22h_gclk_io6 */
#define PA22H_GCLK_IO6 MCHP_PINMUX(a, 22, h, periph)

/* pa22i_ccl_in6 */
#define PA22I_CCL_IN6 MCHP_PINMUX(a, 22, i, periph)

/* pa22k_ptc_ds26 */
#define PA22K_PTC_DS26 MCHP_PINMUX(a, 22, k, periph)

/* pa23_gpio */
#define PA23_GPIO MCHP_PINMUX(a, 23, gpio, gpio)

/* pa23a_eic_extint7 */
#define PA23A_EIC_EXTINT7 MCHP_PINMUX(a, 23, a, periph)

/* pa23b_ptc_x11 */
#define PA23B_PTC_X11 MCHP_PINMUX(a, 23, b, periph)

/* pa23b_ptc_y27 */
#define PA23B_PTC_Y27 MCHP_PINMUX(a, 23, b, periph)

/* pa23c_sercom3_pad1 */
#define PA23C_SERCOM3_PAD1 MCHP_PINMUX(a, 23, c, periph)

/* pa23d_sercom5_pad1 */
#define PA23D_SERCOM5_PAD1 MCHP_PINMUX(a, 23, d, periph)

